# IsValidColumnIndex Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTable..::..IsValidColumnIndex Method
FamilySizeTable Class See Also
---
Checks if the column index is valid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsValidColumnIndex(
	int index
)
```

Visual Basic
---
```text
Public Function IsValidColumnIndex ( _
	index As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidColumnIndex(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The index of the column.
# ### Return Value
True if the column index is valid, false otherwise.
# See Also
FamilySizeTable Class
Autodesk.Revit.DB Namespace